//
//  ListOfWordsByCategories.swift
//  BoardBunnyGame
//
//  Created by Ilya Maslau on 2.03.22.
//

// MARK: - mostly used for update firestore fastly

enum WordCategory: String, CaseIterable, Identifiable, Hashable, Codable {
    
    var id: String {
        return self.getTopicTitle()
    }

    case random
    case marvel
    case nature
    case music
    case animals
    case hobby
    case seriesAndFilms
    case food
    case fantasy
    case abstract
    case cinemaWorld
    case bodyParts
    case flowers
    case clothes
    case inCity
    case countries
    case school
    case transport
    case astrologicalSigns
    case weirdWords

    func getTopicTitle() -> String {
        switch self {
        case .random:
            return "Случайная тема"
        case .marvel:
            return "MARVEL"
        case .nature:
            return "Природа"
        case .animals:
            return "Животные"
        case .fantasy:
            return "Фентези"
        case .inCity:
            return "Внутри города"
        case .cinemaWorld:
            return "Из мира кино"
        case .countries:
            return "Страны"
        case .school:
            return "Школа"
        case .music:
            return "Музыка"
        case .transport:
            return "Транспорт"
        case .food:
            return "Еда"
        case .flowers:
            return "Цветы"
        case .bodyParts:
            return "Части тела"
        case .clothes:
            return "Одежда"
        case .hobby:
            return "Хобби"
        case .seriesAndFilms:
            return "Фильмы и Сериалы"
        case .abstract:
            return "Абстрактные вещи"
        case .astrologicalSigns:
            return "Знаки зодиака"
        case .weirdWords:
            return "Чуть сложнее"
        }
    }

    func getWordsByTopic() -> [String] {
        switch self {
        case .marvel:
            return Words.marvelWords
        case .nature:
            return Words.natureWords
        case .animals:
            return Words.animalsWords
        case .fantasy:
            return Words.fantasyWords
        case .inCity:
            return Words.inCityWords
        case .school:
            return Words.schoolWords
        case .seriesAndFilms:
            return Words.seriesAndFilmsWords
        case .transport:
            return Words.transportWords
        case .food:
            return Words.foodWords
        case .flowers:
            return Words.flowersWords
        case .bodyParts:
            return Words.bodyPartWords
        case .countries:
            return Words.countriesWords
        case .cinemaWorld:
            return Words.cinemaWords
        case .clothes:
            return Words.clothesWords
        case .astrologicalSigns:
            return Words.astrologicalSignsWords
        case .abstract:
            return Words.abstractWords
        case .music:
            return Words.musicWords
        case .hobby:
            return Words.hobbyWords
        case .weirdWords:
            return Words.weirdWords
        default:
            return []
        }
    }
}

extension WordCategory {
    enum Words {
        static var natureWords: [String] = [
            "бог", "природа", "космос", "звезда", "солнце", "луна", "планета", "спутник", "земля", "свет", "мир", "вода",
            "лёд", "волна", "океан", "море", "озеро", "канал", "река", "остров", "берег", "гора", "поле",  "дорога", "путь",
        ]

        static var animalsWords: [String] = [
            "динго (дикая собака)", "летучая мышь", "аллигатор", "осёл",
            "антилопа", "барсук", "медведь", "медведь", "птица", "бобр", "буйвол",
            "попугайчик", "бык", "ослик", "кролик", "канарейка",
            "верблюд", "гепард", "кот", "кролик", "бурундук", "койот", "корова", "ворон",
            "крокодил", "олень", "осёл", "собака, пёс", "слон", "верблюд",
            "овца", "лось", "лиса", "рыба", "жираф", "лягушка", "горилла", "козёл", "заяц(такое слово)",
            "хомяк", "лошадь", "ёж", "гиена", "кенгуру", "ягуар",
            "котёнок", "козлёнок", "овечка", "коала", "лев", "леопард", "рысь", "ящерица",
            "норка", "кобыла", "обезьяна", "крот", "мул", "мышь", "панда",
            "попугай", "пантера", "кабан", "свинья", "дельфин", "пони", "кролик", "пума", "крыса", "баран",
            "носорог", "олень", "змея", "овца", "жеребец", "белка", "жаба", "тигр", "морж", "черепаха",
            "кошка", "кит", "зебра", "волк"
        ]

        static var fantasyWords: [String] = [
            "арбалет", "баллиста", "баронесса", "князь", "вождь", "герцогиня", "гном", "гоблин, гном",
            "граф", "дворец", "дворянство", "династия", "драгоценности", "казна",
            "единорог", "империя", "царство", "катапульта", "кольчуга", "королева",
            "король", "крепостной", "раб", "леди", "лук (оружие)", "монарх",
            "башня", "поместье", "принц", "ров", "рыцарство", "скипетр", "сторожка",
            "темница", "укрепление", "вал", "форт", "хоббит", "королевство", "шут", "эльф",
            "аристократия", "барон", "башня", "цитадель", "крепость", "топор", "высочество (титул)",
            "герцог", "гоблин", "граф", "графиня", "дева", "доспехи",
            "дракон", "копье", "пика", "моргентшерт", "власть", "корона", "крепость", "лорд", "господин",
            "лучник", "стрелок", "меч", "рапира", "монарх", "повелитель", "орк", "осада",
            "подъемный мост", "Придворный шут", "принцесса", "рыцарский поединок", "турнир", "рыцарь",
            "служанка", "горничная", "сторожевая башня", "стрела", "таран", "титул", "звание", "честь", "щит"
        ]

        static var inCityWords: [String] = [
            "стоянка", "арка", "бассейн", "тупик", "здание", "постройка", "сооружение",
            "строение", "церковь", "цирк", "угол", "перекрёсток", "тупик", "универмаг",
            "пожарное депо", "клумба", "галерея", "парикмахерская", "гостиница", "отель", "перекрёсток",
            "библиотека", "памятник", "мечеть", "музей", "парк", "сквер", "тротуар", "галерея",
            "почта", "дорога", "шоссе", "скамья", "лавка", "магазин", "площадь", "киоск", "улица", "окраина",
            "пригород", "супермаркет", "синагога", "театр", "план города", "светофор", "зоопарк", "бар",
            "скамья", "мост", "кафе", "кофейня", "кинотеатр", "город", "перекрёсток",
            "переход", "переправа", "переход", "тупик", "фонтан", "ворота",
            "больница", "лазарет", "перекрёсток", "киоск", "телефонная будка", "базар", "рынок", "памятник",
            "монумент", "кино", "ночной клуб", "переход", "полиция", "ресторан", "дорожный знак",
            "тротуар", "стадион", "статуя", "план города", "подземный переход", "бассейн", "остановка",
            "городок", "площадь", "подземный переход"
        ]

        static var schoolWords: [String] = [
            "доска объявлений, информационное табло", "учебный год", "стол дежурных", "аудитория",
            "парковка для велосипедов", "классная доска", "книжный шкаф", "ботаника",
            "университетский или школьный двор", "стул, место за партой", "химия", "класс",
            "классный руководитель", "класс, классная комната", "школьное сочинение", "класс информатики",
            "школьная тетрадь", "учебный план", "кабинет директора", "тетрадь для рисования",
            "тряпка", "образование", "ластик, резинка", "экзамен, зачёт", "школьная тетрадь", "выпускные экзамены",
            "зарубежная литература", "классный руководитель", "география", "глобус", "выпускной класс",
            "директор", "директор", "завуч", "история", "домашнее задание", "информатика", "преподаватель, учитель",
            "интернет", "урок, занятие", "тетрадь в линейку", "главный вход",
            "оценка", "математика", "иностранные языки", "музыка", "музыкальный класс", "блокнот",
            "органическая химия", "ручка", "пенал", "философия", "физика", "указка", "кабинет директора",
            "ученик", "читальный зал", "большая перемена", "каникулы", "туалет", "черновая тетрадь",
            "бумага в линейку", "школьное образование", "актовый зал", "учебные пособия", "школьный работник",
            "школьная олимпиада", "ученик, школьник", "школьные дни", "школьное здание", "выпускные экзамены",
            "школьный учитель", "классная комната", "стул, место за партой", "семестр", "тетрадь для рисования",
            "бумага в клетку", "студент, ученик", "учебный предмет", "учительский стол", "учительская",
            "контрольная работа", "расписание", "прогуливать уроки", "туалет", "учебные пособия", "тетрадь",
            "алгебра", "астрономия", "звонок", "биология", "книга", "книжная полка", "перемена",
            "кафетерий, кафе-закусочная", "буфет, столовая", "мел", "классный журнал", "классная работа",
            "конкурсный экзамен", "компьютер", "внутренний двор", "парта", "рисование, черчение", "раздевалка", "экология",
            "учебное заведение", "сочинение", "экзамен", "изложение", "иностранные языки", "класс", "географическая карта",
            "геометрия", "класс", "гимназия", "заведующий", "директор", "хорошие отметки",
            "каникулы", "домашнее задание", "неорганическая химия", "перемена, перерыв", "правоведение", "библиотека",
            "литература", "лицей", "карта", "математика", "конференц-зал", "современная литература",
            "нотная тетрадь", "природоведение", "записная книжка, блокнот", "проектор", "карандаш",
            "пенал", "физкультура", "подиум", "директор", "контрольная работа",
            "читальный зал", "справочники", "расписание", "линейка", "школьный ранец", "учебное время", "школьная форма", "школьные годы",
            "школьный совет", "школьная подруга", "выпускник",
            "школьный учитель", "школьный товарищ", "школьный учитель", "научная комната", "охранник", "душевая", "кладовая",
            "учитель", "преподаватель", "педагог", "учительский стол", "семестр, сессия",
            "учебник, руководство", "учебные пособия", "каникулы", "блокнот"
        ]

        static var transportWords: [String] = [
            "транспортное средство", "трамвай", "машинa", "такси", "велосипед", "корабль", "лодка", "самолет",
            "космический корабль", "электрический", "автобус", "троллейбус", "грузовик", "мотоцикл",
            "скутер", "самокат", "баржа", "яхта", "вертолёт", "поезд", "метро"
        ]

        static var foodWords: [String] = [
            "сливки", "крем", "кафе", "бар", "десертная ложка", "черника", "чеснок", "дуршлаг",
            "салат-латук", "сметана", "бисквит", "кофемолка", "кипятильник", "крышка",
            "ломоть, толстый кусок", "окунь", "открывашка", "имбирь",
            "рыбное блюдо", "ужин", "кондитерская", "кондитерские изделия", "пончик", "пышка",
            "фруктовый пирог", "кафетерий", "кафе-закусочная", "овсяная каша",
            "отбивная", "ростбиф", "батон", "буханка", "каравай", "сыр", "яичница-глазунья",
            "ассорти", "мороженое", "крыжовник", "тефтели", "фрикадельки", "яйцо",
            "овощи", "слива", "поваренная книга", "петрушка", "хлеб с отрубями", "треска", "чернослив", "угорь",
            "маргарин", "кувшин", "почки", "жаренный цыпленок", "кора", "кожура", "помидор",
            "хлеб", "щипцы", "вишня", "пюре", "лещ", "клюква", "редис",
            "печенка", "рюмка", "стакан", "стеклянная посуда", "орех", "диета", "кофеварка",
            "шпинат", "майонез", "пирог", "пирожок", "омлет", "черешня", "бифштекс",
            "второй завтрак", "ланч", "овощ", "сухарь", "лук", "миска", "тарелка", "лимоновыжималка",
            "дыня", "мясорубка", "кастрюля", "ковшик", "ложка", "пшено", "меню", "яичница-болтунья",
            "лепешка", "окорочка", "спаржа", "скумбрия", "стакан молока", "уксус", "рыбные консервы", "ежевика", "желток", "желе",
            "специя", "нож", "бидон", "оливка", "пища", "питание", "корица", "блюдце", "арахис", "соковыжималка", "груша", "горчичница",
            "яблоко", "оладьи", "блины", "молочный коктейль", "приправа", "питьё", "напиток", "пряник", "курица", "куропатка", "подлива",
            "плавленый сыр", "термос", "кислая капуста", "куриный бульон", "скорлупа", "кукуруза",
            "зерно", "зёрнышко", "изюм", "официантка", "кекс", "омар", "гренки", "супница", "повар",
            "крупа", "белок", "половник", "черпак", "кукурузный початок", "горшочек",
            "капуста", "терка", "сушилка для посуды", "банан", "цветная капуста",
            "чипсы", "тесто", "штопор", "рябчик", "ваниль", "горох", "карп", "гарнир", "скалка", "лапша",
            "гриб", "абрикос", "завтрак", "сэндвич с яйцом", "аппетит", "хрен", "маслина", "десерт",
            "кофейник", "баклажан", "конфеты", "заказ (в ресторане)", "вилка", "порция", "ресторан", "бульон", "напиток", "нож",
            "икра", "йогурт", "вареное яйцо", "молочник", "обедать", "панировочные сухари", "малина",
            "апельсин", "цыпленок", "курятина", "сковородка", "консервная банка", "персик", "гусь",
            "посудомойка", "кролик", "окорок", "ветчина", "огурец", "свинина", "рыба",
            "рис", "белый хлеб", "бобы", "фасоль", "устрица", "гуси", "лимон",
            "таймер", "домашняя птица", "молоко", "топленое масло",
            "мед", "сладость", "закуска", "сливочное масло", "ягода", "ананас", "сахарница", "варенье",
            "телятина", "шоколад", "рассол", "солонка", "мармелад", "краб", "рак", "фазан",
            "миндаль", "виноград", "земляника", "клубника", "грейпфрут", "тостер",
            "соль", "поваренная соль", "сосиска", "колбаса", "картофель", "манная крупа", "горчица",
            "растительное масло", "чайник", "сардина", "кружка", "миксер", "крошки", "суп", "шоколадные конфеты", "булочка",
            "жаренный картофель", "мандарин", "мука", "сом", "гранат", "обед", "скороварка", "смородина", "сыр", "дичь", "торт", "кекс",
            "пирожное", "лепёшка", "мука", "индейка", "официант",
            "заварник", "тарелка", "поднос", "буфет", "пудинг", "перечница", "кухонные весы",
            "кукурузные хлопья", "карамель", "грудинка", "ребра", "сахар", "бутерброд", "парное молоко",
            "щука", "свекла", "фрукты", "креветка", "рецепт", "гамбургер", "говядина", "фисташка", "мясо",
            "арбуз", "кабачок", "блюдо", "дрожжи", "морковь", "килька", "шпрота", "укроп",
            "чайная ложка", "репа", "начинка", "фарш", "форель", "баранина", "тыква", "мясной фарш",
            "фасоль", "перец", "грецкий орех", "чашка", "сельдь", "творог", "хлеб", "лосось", "сахарная пудра", "овес", "утка",
        ]

        static var countriesWords: [String] = [
            "Австрия", "Албания", "Ангола", "Аргентина", "Афганистан", "Бангладеш", "Бахрейн", "Белиз", "Бенин", "Бирма",
            "Боливия", "Ботсвана", "Бруней", "Бурунди", "Вануату", "Великобритания", "Венесуэла", "Вьетнам", "Гайана", "Гамбия",
            "Гватемала", "Гвинея-Бисау", "Гондурас", "Греция", "Дания", "Доминика", "Египет", "Зимбабве", "Израиль", "Индонезия",
            "Ирак", "Ирландия", "Испания", "Кабо-Верде", "Камбоджа", "Камерун", "Катар", "Кипр", "Кирибати", "Коморские острова",
            "Корея", "Куба", "Лаос", "Лесото", "Ливан", "Литва", "Люксембург", "Мавритания", "Македония", "Малайзия", "Мальдивы",
            "Марокко", "Мексика", "Мозамбик", "Монако", "Намибия", "Непал", "Нигерия", "Никарагуа", "Норвегия", "Оман",
            "Палау", "Папуа-Новая Гвинея", "Перу", "Португалия", "Руанда", "Сальвадор", "Сан - Марино", "Саудовская Аравия",
            "Северная Корея", "Сенегал", "Сент-Китс и Невис", "Сербии", "Сирия", "Словения", "Соломоновы острова", "Судан",
            "Сьерра-Леоне", "Таиланд", "Того", "Тринидад и Тобаго", "Тунис", "Турция", "Узбекистан", "Уругвай", "Филиппины",
            "Франция", "Центрально-Африканская Республика", "Черногория", "Чили", "Швеция", "Эквадор", "Эритрее", "Эфиопия",
            "Южная Корея", "Япония", "Австралия", "Азербайджан", "Алжир", "Андорра", "Армения", "Багамские острова", "Барбадос",
            "Беларусь", "Бельгия", "Берег Слоновой Кости", "Болгария", "Босния и Герцеговина", "Бразилия", "Буркина-Фасо", "Бутан", "Ватикан", "Венгрия", "Восточный Тимор", "Габон", "Гаити", "Гана", "Гвинея", "Германия", "Гренада", "Грузия",
            "Джибути", "Доминиканская Республика", "Замбия", "Йемен", "Индия", "Иордания", "Иран", "Исландия", "Италия",
            "Казахстан", "Камбоджа", "Канада", "Кения", "Киргизия", "Китай", "Конго", "Коста-Рика", "Кувейт", "Латвия",
            "Либерия", "Ливия", "Лихтенштейн", "Маврикий", "Мадагаскар", "Малави", "Мали", "Мальта", "Маршалловы острова",
            "Микронезия", "Молдова", "Монголия", "Науру", "Нигер", "Нидерланды", "Новая Зеландия",
            "Объединенные Арабские Эмираты", "Пакистан", "Панама", "Парагвай", "Польша", "Россия", "Румыния", "Самоа",
            "Сан-Томе и Принсипи", "Свазиленд", "Сейшельские острова", "Сент-Винсент и Гренадины", "Сент-Люсия", "Сингапур",
            "Словакия", "Соединенные Штаты Америки", "Сомали", "Суринам", "Таджикистан", "Танзания", "Тонга", "Тувалу",
            "Туркменистан", "Уганда", "Украина", "Фиджи", "Финляндия", "Хорватия", "Чад", "Чешская республика", "Швейцария",
            "Шри Ланка", "Экваториальная Гвинея", "Эстония", "ЮАР", "Ямайка"
        ]

        static var flowersWords: [String] = [
            "букет", "маргаритка", "клевер", "цветок", "хризантема",
            "бархатец", "нарцисс", "роза", "анютины глазки", "гвоздика", "колокольчик", "подсолнух", "орхидея", "цвести",
            "календула, ноготки", "маргаритка", "цикорий", "бутон розы", "василёк", "бархатцы", "иван-чай", "алоэ", "пион",
            "крапива", "лютик", "герань, журавельник", "одуванчик", "гладиолус", "цвести", "анютины глазки", "георгин",
            "колокольчик", "лаванда", "мак", "незабудка", "цветы", "ромашка", "настурция, капуцин", "шалфей", "азалия",
            "колокольчик", "гвоздика", "анемон, ветреница", "лилия", "мимоза", "тростник, камыш", "бутон, почка", "шип", "фиалка",
            "кувшинка, лилия(водяная)", "первоцвет", "молочай", "люпин", "акация", "нарцисс", "ромашка",
            "астра", "комнатный цветок", "подснежник", "тюльпан"
        ]

        static var bodyPartWords: [String] = [
            "Череп", "Челюсть", "Щека", "Язык", "череп", "Глаз", "Ноздря", "Череп", "Волосы", "Веки", "Горло", "Кадык", "Бровь", "Губа",
            "Затылок", "Лоб", "Шея", "Зуб", "Рот", "Ресница", "Голова", "Ухо", "Подбородок", "Нос", "Висок", "Лицо", "рот", "ухо",
            "предплечье", "палец", "тело", "сосок", "кожа", "волосы", "запястье", "голова", "бровь", "щека", "ящик", "локоть", "глаз",
            "усы", "живот", "кисть", "нос", "ноготь", "колено", "плечо", "ступня", "лоб", "шея", "спина",
            "подбородок", "нога", "рука", "пупок"
        ]

        static var abstractWords: [String] = [
            "воля", "усилие", "решение", "желание", "цель", "ум", "мысль", "идея", "мнение",
            "душа", "знание", "настроение", "чувство", "удовольствие", "радость", "смех", "улыбка", "счастье", "сожаление",
            "слеза", "страх", "ужас", "волнение", "удивление", "интерес", "любовь", "надежда", "вера", "долг", "печаль", "гнев"
        ]

        static var clothesWords: [String] = [
            "атлас", "бархат", "бельё", "блузка", "ботинок", "браслет", "брюки", "булавка", "бумажник", "воротник",
            "вуаль", "галстук", "губная помада", "дамское бельё", "джинсы","духи", "жилет", "зонтик", "игла", "карман",
            "кожа", "колготки", "кольцо", "костюм", "кошелёк", "кроссовки", "купальный костюм", "куртка", "лифчик", "майка", "мех",
            "нитка", "носовой платок", "носок", "ночная сорочка", "обувь", "одежда", "очки", "пальто", "перчатка", "пижама", "плавки",
            "платье", "плащ", "подкладка", "портфель", "пуговица", "пуловер", "пятно", "размер", "рвать", "ремень", "розовый",
            "рубашка", "рукав", "сандалия", "серьга", "солнцезащитные очки", "спица", "ткань", "трусы", "туфля", "фиолетовый",
            "футболка", "хлопок", "цвет", "цепочка", "чулок", "шарф", "швейная машина", "шёлк", "шерсть", "шляпа",
            "шнурок", "шорты", "шуба", "юбка", "ювелирные изделия"
        ]

        static var astrologicalSignsWords: [String] = [
            "Овен", "Телец", "Близнецы", "Рак", "Лев", "Дева", "Весы", "Скорпион", "Стрелец", "Козерог", "Водолей", "Рыбы",
            "Крыса", "Бык", "Тигр", "Кролик", "Дракон", "Змея", "Лошадь", "Коза", "Обезьяна", "Петух", "Собака", "Свинья"
        ]

        static var cinemaWords: [String] = [
            "кинотеатр, куда можно въехать на автомобиле", "боевик", "актер / актриса",
            "приключенческий фильм", "вымышленное имя", "аниматор", "соотношение сторон (формат)", "кулисы",
            "черно-белый фильм", "касса", "оператор", "титры", "мультфильм", "актерский состав", "персонаж", "кино(театр)", "хлопушка",
            "крупный план", "цветной фильм", "комедия", "дизайнер по костюмам", "съемочная группа", "детектив", "массовка", "режиссер",
            "документальный фильм", "драма", "общеобразовательный фильм", "эпизод", "серия",
            "художественный фильм", "фильм", "плёнка", "воспоминания героя", "возврат в прошлое", "полнометражный фильм",
            "счастливый конец", "исторический фильм", "фильм ужасов", "место натурных съемок", "общий план", "грим", "кинофильм",
            "мюзикл", "немой фильм", "трейлер", "саундтрек", "сюжет", "афиша", "пост-продакшн", "продюсер", "сцена",
            "научно-фантастический фильм", "экран", "экранизация", "сценарий", "драматург", "сериал", "декорации", "декоратор",
            "короткометражный фильм", "кадр", "показ", "звуковой фильм", "фильм со звездами", "кадр", "трюк",
            "каскадер", "субтитры", "дубль (на съемке)", "финальная сцена", "главная роль", "начальная сцена", "триллер", "трагедия",
            "визуальные эффекты", "вестерн", "фильм для взрослых", "трехмерное кино"
        ]

        static var musicWords: [String] = [
            "аккордеон", "альбом", "волынка", "балалайка", "балет", "группа", "контрабас",
            "дирижерская палочка", "смычок", "медные духовые инструменты", "виолончель", "кларнет", "классическая музыка",
            "композитор", "концерт", "дирижер", "тарелки", "барабан", "барабанные палочки", "флейта", "рояль", "гитара", "арфа",
            "рожок", "инструментальная музыка", "динамик, громкоговоритель", "микрофон", "музыкальные инструменты", "музыкант",
            "опера", "оперетта", "оркестр", "орган", "перкуссия (ударные инструменты)", "пианино", "сольный концерт",
            "саксофон", "сингл", "солист", "песня", "звук", "струнные инструменты", "симфония", "синтезатор",
            "тромбон", "труба", "туба", "видео-клип", "скрипка", "виртуоз", "духовые инструменты", "Поп", "Рок", "Рэп",
            "Хип-хоп", "Блюз", "Метал", "Электроника", "Дабстеп", "Тиктоник", "Шансон", "Народная музыка", "Трэп"
        ]

        static var hobbyWords: [String] = [
            "аниме", "аквариумистика", "нарды", "бальные танцы", "баскетбол", "бисероплетение",
            "бильярд", "боулинг", "брейк данс", "карты", "резьба по дереву", "кино", "цирк", "шашки", "шахматы", "компьютерные игры",
            "кроссворды", "коллекционирование", "кроссворды", "кататься на велосипеде", "диггерство", "дайвинг", "домино",
            "рисовать", "вышивание", "конный спорт", "фэншуй", "рыбалка", "фитнес", "футбол", "граффити", "хоккей", "охота",
            "картинг", "вязание", "латиноамериканские танцы", "гонки на мотоцикле", "альпинизм", "музыка",
            "восточные танцы", "оригами", "паркур", "фотография", "играть на гитаре", "играть на пианино",
            "играть на баяне", "скалолазание", "ролики", "бег", "русские народные танцы", "петь", "сканворды", "скульптура",
            "шоппинг", "скейтбординг", "лыжи", "прыжки с парашютом", "санки", "сноубординг", "снегоход", "баня", "плавание",
            "разговаривать по телефону", "татуировка", "теннис", "театр", "туризм",
            "волейбол", "виндсёрфинг", "виноделие", "писать стихи", "йога"
        ]

        static var seriesAndFilmsWords: [String] = [
            "Во все тяжкие", "Шерлок", "Настоящий детектив", "Стрела", "Игра престолов", "Друзья", "Готэм", "Сверхъестественное",
            "Теория большого взрыва", "Как я встретил вашу маму", "Клиника", "Доктор Хаус", "Ходячие мертвецы", "Очень странные дела",
            "Доктор Кто", "Черное зеркало", "Острые козырьки", "Симпсоны", "Мандалорец", "Дневники вампира", "Мир Дикого Запада", "Чернобыль", "Сорвиголова", "Американская история ужасов", "Пацаны", "Отбросы", "Хороший доктор", "Конец ***го мира",
            "Благие знамения", "Молодой Шелдон", "Роковой патруль", "Американские боги", "Леденящие душу приключения Сабрины",
            "Рик и Морти", "Бесстыжие", "Аркейн", "Голяк", "Время приключений", "Силиконовая долина", "Сваты", "Бумажный дом",
            "Элита", "Миротворец", "Ход королевы", "Древние", "Бригада", "Любовь. Смерть. Роботы", "Мандалорец", "Люцифер",
            "Игра в кальмара", "Половое воспитание (Sex Education)", "Ривердэйл", "Эйфория", "Флэш", "Наследие", "Локи",
            "видоизмененный углерод", "Мир дикого запада", "легенды завтрашнего дня", "Константин", "Пенниуорт",
            "Джесика Джонс", "Проповедник", "Эйфория", "Сотня", "Я-зомби", "Убийственный класс",
            "Детективное агенство Дирка джентли", "Академия Амбрелла", "Волчонок", "Под куполом", "Волшебники",
            "Побег из Шоушенка", "Крёстный отец", "Тёмный рыцарь", "12 разгневанных мужчин", "Список Шиндлера",
            "Криминальное чтиво", "Хороший, плохой, злой", "Бойцовский клуб", "Форрест Гамп", "Начало", "Властелин колец",
            "Звёздные войны", "Матрица", "Славные парни", "Пролетая над гнездом кукушки", "Молчание ягнят", "Эта прекрасная жизнь",
            "Спасти рядового Райана", "Зелёная миля", "Унесённые призраками", "Интерстеллар", "Паразиты", "Леон", "Харакири",
            "Подозрительные лица", "Король Лев", "Пианист", "Терминатор", "Назад в будущее", "Американская история Икс",
            "Новые времена", "Гладиатор", "Психо", "Отступники", "Огни большого города", "1+1", "Одержимость",
            "Могила светлячков", "Престиж", "Однажды на Диком Западе", "Касабланка", "Чужой", "Апокалипсис сегодня", "Помни",
            "Великий диктатор", "Индиана Джонс", "Джанго освобождённый", "Жизнь других", "Гамильтон", "Джокер", "ВАЛЛ-И",
            "Сияние", "Мстители: Война бесконечности", "Бульвар Сансет", "Свидетель обвинения", "Олдбой",
            "Человек-паук: Через вселенные", "Принцесса Мононоке", "Доктор Стрейнджлав, или Как я перестал бояться и полюбил бомбу",
            "Тёмный рыцарь: Возрождение легенды", "Однажды в Америке", "Твоё имя", "Чужие", "Тайна Коко",
            "Мстители: Финал", "Капернаум", "Красота по-американски", "Храброе сердце", "Рай и ад", "Подводная лодка",
            "История игрушек", "3 идиота", "Амадей", "Бесславные ублюдки", "Умница Уилл Хантинг", "Звёздочки на земле",
            "Бешеные псы", "Космическая одиссея 2001 года", "Реквием по мечте", "Охота", "Головокружение",
            "Вечное сияние чистого разума", "Гражданин Кейн", "Дангал", "Лига справедливости Зака Снайдера",
            "Поющие под дождём", "Малыш", "Похитители велосипедов", "Цельнометаллическая оболочка", "Иди и смотри", "Жить",
            "Большой куш", "К северу через северо-запад", "Заводной апельсин", "Лицо со шрамом", "1917", "Таксист", "Пожары",
            "Развод Надера и Симин", "История игрушек: Большой побег", "Лоуренс Аравийский", "Афера", "Амели", "Метрополис",
            "Квартира", "На несколько долларов больше", "Двойная страховка", "Убить пересмешника", "Вверх",
            "Индиана Джонс и последний крестовый поход", "Схватка", "Секреты Лос-Анджелеса", "Зелёная книга",
            "Крепкий орешек", "Бэтмен: Начало", "Монти Пайтон и Священный Грааль", "Телохранитель", "Расёмон", "Бункер",
            "Дети небес", "Ран", "Непрощённый", "В джазе только девушки", "Ходячий замок", "Всё о Еве", "Казино", "Игры разума",
            "Волк с Уолл-стрит", "Большой побег", "Лабиринт фавна", "Нефть", "Тайна в его глазах", "Карты, деньги, два ствола",
            "Нюрнбергский процесс", "Бешеный бык", "Мой сосед Тоторо", "Сокровища Сьерра-Мадре", "В случае убийства набирайте «М»",
            "Три билборда на границе Эббинга, Миссури", "Остров проклятых", "Китайский квартал", "Золотая лихорадка",
            "Мой отец и мой сын", "Старикам тут не место", "V — значит вендетта", "Головоломка", "Нечто", "Человек-слон",
            "Седьмая печать", "Воин", "Шестое чувство", "Парк юрского периода", "Клаус", "На игле", "Шоу Трумана",
            "Унесённые ветром", "В поисках Немо", "Сталкер", "Земляничная поляна", "Воспоминания об убийстве",
            "Убить Билла. Фильм 1", "Бегущий по лезвию", "Мост через реку Квай", "Фарго", "Комната", "Дикие истории",
            "Токийская повесть", "Гран Торино", "Третий человек", "В порту", "Охотник на оленей", "Во имя отца", "Мэри и Макс",
            "Отель «Гранд Будапешт»", "Перед рассветом", "Поймай меня, если сможешь", "Исчезнувшая", "По соображениям совести",
            "Пленницы", "Персона", "Стреляйте в пианиста", "Шерлок-младший", "Большой Лебовски", "Барри Линдон",
            "Быть или не быть", "Генерал", "Как приручить дракона", "Ford против Ferrari", "12 лет рабства", "Осенняя соната",
            "Бандит", "Мистер Смит едет в Вашингтон", "Ананд", "Безумный Макс: Дорога ярости", "Общество мёртвых поэтов",
            "Малышка на миллион", "Гарри Поттер и Дары Смерти. Часть 2", "Останься со мной", "Телесеть", "Бен-Гур",
            "Хатико: Самый верный друг", "Золушка", "Служанка", "Хладнокровный Люк", "Логан", "Взвод", "В диких условиях",
            "Плата за страх", "Гонка", "Ненависть", "Житие Брайана по Монти Пайтону", "Четыреста ударов", "Страсти Жанны д’Арк",
            "В центре внимания", "Душа", "Отель Руанда", "Банды Вассейпура", "Сука любовь", "Андрей Рублёв", "Корпорация монстров",
            "Рокки", "Навсикая из Долины ветров", "Ребекка", "Время цыган", "Перед закатом", "Любовное настроение", "Мужские разборки",
            "Цвет шафрана", "Париж, Техас", "Видимость", "Портрет девушки в огне", "Это случилось однажды ночью", "Конец Евангелиона",
            "Форма голоса", "Видимость", "Возвращение на Родину", "Невидимый гость"
        ]

        static var marvelWords: [String] = [
            "Алая Ведьма", "Альтрон", "Баки", "Барон Земо", "Блэйд", "Валькирия", "Веном",
            "Вижен", "Воитель", "Вонг", "Гамора", "Гвен Стейси", "Грут", "Джей Джона Джеймсон", "Джаггернаут", "Джессика Джонс",
            "Джин Грей", "Доктор Дум", "Доктор Стрэндж", "Домино", "Дормамму", "Дракс Разрушитель", "Дэдпул", "Железный патриот",
            "Железный Человек", "Зверь", "Звёздный Лорд", "Зелёный гоблин", "Зомби", "Икс-23", "Йонду", "Капитан Америка", "Кейбл",
            "Капитан Марвел", "Каратель", "Карнаж", "Кингпин", "Кинжал", "Коллекционер", "Колосс", "Красный Череп", "Крэйвен-охотник",
            "Локи", "Лунный Рыцарь", "Магнето", "Майлз Моралес", "Мандарин", "Мантис", "Меченый", "Мистерио", "Мистик", "Морбиус",
            "Мэри Джейн Уотсон", "Мэй Паркер", "Небула", "Ник Фьюри", "Оса", "Патриот", "Пегги Картер", "Песочный человек",
            "Пеппер Поттс", "Призрачный гонщик", "Профессор Икс", "Рагнарёк", "Росомаха", "Роуг", "Ртуть", "Саблезубый", "Соколиный глаз",
            "Сорвиголова", "Стервятник", "Танос", "Тор", "Т'Чака", "Уильям Страйкер", "Утка Говард", "Феникс", "Фил Колсон",
            "Халк", "Хэнк Пим", "Хэппи Хоган", "Циклоп", "Человек-муравей", "Человек-паук", "Человек-факел",
            "Чёрная вдова", "Чёрная пантера", "Шан-Чи", "Эдди Брок", "Электра", "Электро", "Mjolnir(молот тора)", "Вибраниум",
            "Адамантий", "Джарвис", "Читаури", "Наташа Романов", "Будапешт", "Соковия", "Асгард", "Один(бог)", "Ракета",
            "Стивен Стрендж", "Зимний Солдат", "Корг", "Глаз Агамотто", "Гидра", "Ванда Максимофф", "Иван Ванко", "Брюс Беннер",
            "Камни бесконечности", "Перчатка таноса", "10 колец", "Кейт бишоп", "Тессеракт", "Пьетро", "Ртуть", "Хела",
            "Эго", "Дормаму", "Ваканда", "Дядя Бен", "Заковия", "Камар-тадж", "Нидавелир", "Суртур", "Квилл"
        ]

        static var weirdWords: [String] = [
            "шакал" , "мустанг",  "бастион",  "геральдика", "виконт", "латы", "твердыня", "феодал", "фрейлина",
            "кафедральный собор", "изостудия", "фонотека",  "фонетика", "жаргон", "диапроектор", "инжир", "буженина", "осетрина",
            "финик", "пряность", "масленка", "коврижка", "камбала", "повидло", "простокваша", "утятница", "ватрушка", "крупчатка",
            "винегрет", "галеты", "эдельвейс", "настурция, капуци", "фагот", "гобой", "альт", "авиамоделизм",
            "бейсджампинг", "декупаж", "икебана", "кайтсёрфинг", "парапланеризм", "Глабель — участок на лице между бровями",
            "Вагитус — крик новорожденного младенца", "Чанкинг — плевок едой", "Колумелла — пространство между ноздрями",
            "Колливубл — урчание в животе от голода", "Катавасия - клубок повседневных дел или событий", "шуфлядка",
            "Бухич", "Косяк", "Стяжка", "Фигляр - шут, кривляка", "Пустомеля", "Пуповина", "прозрение",
            "Тесть", "Сват", "Кум", "Теща", "Шурин", "Сноха", "Свекровь", "Золовка", "Деверь", "Пинцет",
            "Скакалка", "самолётоподъёмник", "молекула", "атом", "рефрижератор", "импортёр", "статистика",
            "фликкер", "электрон", "чечёточник", "Ключица"
        ]
    }
}
