//
//  ListOfWordsByCategories.swift
//  BoardBunnyGame
//
//  Created by Ilya Maslau on 2.03.22.
//

enum WordCategory: CaseIterable {
    case nature
    case animals
    case fantasy
    case inCity
    case school
    case transport
    case food
    case random

    func getTopicTitle() -> String {
        switch self {
        case .nature:
            return "Природа"
        case .animals:
            return "Животные"
        case .fantasy:
            return "Фентези"
        case .inCity:
            return "Внутри города"
        case .school:
            return "Школа"
        case .transport:
            return "Транспорт"
        case .food:
            return "Еда"
        case .random:
            return "Случайная тема"
        }
    }

    func getWordsByTopic() -> [String] {
        switch self {
        case .nature:
            return Words.natureWords
        case .animals:
            return Words.animalsWords
        case .fantasy:
            return Words.fantasyWords
        case .inCity:
            return Words.inCityWords
        case .school:
            return Words.schoolWords
        case .transport:
            return Words.transportWords
        case .food:
            return Words.foodWords
        case .random:
            var words: [String] = []
            var allTopics = WordCategory.allCases
            if let indexOfRandom = WordCategory.allCases.firstIndex(of: .random) {
                allTopics.remove(at: indexOfRandom)
            }

            allTopics.forEach { category in
                words += category.getWordsByTopic()
            }

            return words
        }
    }
}

extension WordCategory {
    enum Words {
        static var natureWords: [String] = [
            "бог", "природа", "космос",
            "звезда", "солнце", "луна",
            "планета", "спутник", "земля",
            "свет", "мир",
            "вода", "лёд", "волна", "океан", "море",
            "озеро", "канал", "река", "остров",
            "берег", "гора", "поле",
            "дорога", "путь",
        ]

        static var animalsWords: [String] = [
            "динго (дикая собака)", "летучая мышь", "аллигатор", "осёл",
            "антилопа", "барсук", "медведь", "медведь", "птица", "бобр", "буйвол",
            "волнистый попугайчик", "буйвол", "бык", "ослик", "кролик", "канарейка",
            "верблюд", "гепард", "кот", "кролик", "бурундук", "койот", "корова", "ворон",
            "крокодил", "олень", "осёл", "собака, пёс", "слон", "верблюд",
            "овца", "лось", "лиса", "рыба", "жираф", "лягушка", "горилла", "козёл", "заяц",
            "хомяк", "лошадь", "ёж", "шакал", "гиена", "кенгуру", "ягуар",
            "котёнок", "козлёнок", "овечка", "коала", "лев", "леопард", "рысь", "ящерица",
            "норка", "кобыла", "обезьяна", "крот", "мул", "мышь", "панда", "мустанг",
            "попугай", "пантера", "кабан", "свинья", "дельфин", "пони", "кролик", "пума", "крыса", "баран",
            "носорог", "северный олень", "змея", "овца", "жеребец", "белка", "жаба", "тигр", "морж", "черепаха",
            "дикая", "кошка", "кит", "зебра", "волк"
        ]

        static var fantasyWords: [String] = [
            "арбалет", "баллиста", "баронесса", "бастион", "благородный", "великий князь",
            "вождь", "геральдика", "герцогиня", "гном", "гоблин, гном",
            "граф", "дворец", "дворянство, родовая знать", "династия", "драгоценности из королевской казны",
            "единорог", "империя, царство", "катапульта", "кольчуга", "королева",
            "король", "крепостной, раб", "леди", "лук (оружие)", "монарх",
            "орудийная башня", "поместье", "принц", "ров", "рыцарство", "скипетр", "сторожка у ворот",
            "стрельба из лука", "темница", "укрепление, вал", "форт", "хоббит", "царство, королевство", "шут", "эльф",
            "аристократия", "барон", "башня, цитадель, крепость", "боевой топор", "виконт", "высочество (титул)",
            "герцог", "главная башня", "гоблин", "граф", "графиня", "дворец, замок", "дева", "доспехи, латы",
            "дракон", "замок, дворец, твердыня", "имперский, императорский", "кольчуга", "копье, пика",
            "королевская власть", "королевство, государство", "корона", "крепость", "лорд, господин",
            "лучник, стрелок из лука", "меч, рапира", "монарх, повелитель", "орк", "осада",
            "подъемный мост", "помещичий дом", "Придворный шут", "принцесса", "рыцарский поединок, турнир", "рыцарь",
            "служанка, горничная", "сторожевая башня", "стрела", "таран", "титул, звание", "феодальный",
            "фрейлина", "царить, господствовать", "честь", "щит",
        ]

        static var inCityWords: [String] = [
            "место стоянки автотранспорта", "арка", "бассейн", "тупик", "здание", "постройка", "сооружение",
            "строение", "стоянка машин", "церковь", "цирк", "угол", "перекрёсток", "тупик", "универмаг",
            "пожарное депо", "клумба", "галерея", "парикмахерская", "гостиница", "отель", "перекрёсток",
            "библиотека", "памятник", "мечеть", "музей", "парк", "сквер", "тротуар", "картинная галерея",
            "почта", "дорога", "шоссе", "скамья", "лавка", "магазин", "площадь", "киоск", "улица", "окраина",
            "пригород", "супермаркет", "синагога", "театр", "план города", "светофор", "зоопарк", "бар",
            "скамья", "мост", "кафе", "кофейня", "кафедральный собор", "кинотеатр", "город", "перекрёсток",
            "переход", "переправа", "переход", "тупик", "пожарное депо", "пожарное депо", "фонтан", "ворота",
            "больница", "лазарет", "перекрёсток", "киоск", "телефонная будка", "базар", "рынок", "памятник",
            "монумент", "кино", "ночной клуб", "переход", "полиция", "ресторан", "дорожный знак", "дом быта",
            "тротуар", "стадион", "статуя", "план города", "подземный переход", "бассейн", "стоянка такси",
            "городок", "площадь", "подземный переход"
        ]

        static var schoolWords: [String] = [
            "доска объявлений, информационное табло", "учебный год", "изостудия", "стол дежурных", "аудитория",
            "парковка для велосипедов", "классная доска", "книжный шкаф", "ботаника",
            "университетский или школьный двор", "стул, место за партой", "химия", "класс",
            "классный руководитель", "класс, классная комната", "школьное сочинение", "класс информатики",
            "школьная тетрадь для переписывания", "учебный план", "кабинет директора", "тетрадь для рисования",
            "тряпка", "образование", "ластик, резинка", "экзамен, зачёт", "школьная тетрадь", "выпускные экзамены", "зарубежная литература", "классный руководитель", "география", "глобус", "выпускной класс",
            "директор", "директор", "завуч", "история", "домашнее задание", "информатика", "преподаватель, учитель",
            "интернет", "урок, занятие", "тетрадь в линейку", "плохие отметки", "главный вход",
            "оценка", "математика", "иностранные языки", "музыка", "музыкальный класс", "блокнот",
            "органическая химия", "ручка", "пенал", "философия", "физика", "указка", "кабинет директора",
            "ученик", "читальный зал", "большая перемена, каникулы", "туалет", "черновая тетрадь",
            "бумага в линейку", "школьное образование", "актовый зал", "учебные пособия", "школьный работник",
            "школьная олимпиада", "ученик, школьник", "школьные дни", "школьное здание", "выпускные экзамены",
            "школьный учитель", "классная комната", "стул, место за партой", "семестр", "тетрадь для рисования",
            "бумага в клетку", "студент, ученик", "учебный предмет", "учительский стол", "учительская",
            "контрольная работа", "расписание", "прогуливать уроки", "туалет", "учебные пособия", "тетрадь",
            "алгебра", "астрономия", "фонотека", "звонок", "биология", "книга", "книжная полка", "перемена",
            "кафетерий, кафе-закусочная", "буфет, столовая", "мел", "ребёнок школьного возраста",
            "классный журнал", "классная работа", "конкурсный экзамен", "компьютер", "отметка по поведению",
            "внутренний двор", "парта", "рисование, черчение", "раздевалка", "экология", "учебное заведение",
            "сочинение", "экзамен", "школьное изложение", "иностранные языки", "класс", "географическая карта", "геометрия", "класс", "гимназия", "заведующий учебной частью", "директор", "хорошие отметки",
            "каникулы", "домашнее задание", "неорганическая химия", "перемена, перерыв", "правоведение", "библиотека",
            "литература", "лицей", "карта", "математика", "конференц-зал", "современная литература",
            "нотная тетрадь", "природоведение", "записная книжка, блокнот", "проекционный аппарат", "карандаш",
            "пенал", "физкультура", "подиум", "директор колледжа или школы", "проектор", "контрольная работа",
            "читальный зал", "справочники", "расписание дежурств", "линейка", "школьный ранец",
            "школьный учебно-опытный участок", "учебное время", "школьная форма", "школьные годы",
            "школьный совет", "школьный жаргон", "школьная подруга", "выпускник; ученик бросивший школу",
            "школьный учитель", "школьный товарищ", "школьный учитель", "научная комната", "охранник",
            "душевая", "диапроектор", "кладовая, складское помещение", "учебное время (в вузе)",
            "учитель, преподаватель, педагог", "учительский стол", "семестр, сессия", "учебник, руководство",
            "опоздать на урок", "отмечать присутствующих", "учебные пособия", "каникулы", "блокнот"
        ]

        static var transportWords: [String] = [
            "транспортное средство", "трамвай", "машинa", "такси", "велосипед", "корабль", "лодка", "самолет",
            "космический корабль", "электрический", "автобус", "троллейбус", "грузовик", "мотоцикл",
            "скутер", "самокат", "баржа", "яхта", "вертолёт", "поезд", "метро"
        ]

        static var foodWords: [String] = [
            "сливки", "крем", "кафе", "бар", "запекать", "десертная ложка", "черника", "чеснок", "дуршлаг",
            "салат-латук", "перекусить", "сметана", "бисквит", "кофемолка", "кипятильник", "инжир", "крышка",
            "ломоть, толстый кусок", "окунь", "бутылочная открывалка", "острый", "буженина", "имбирь",
            "рыбное блюдо", "ужин", "кондитерская", "кондитерские изделия", "пончик", "пышка", "копченый",
            "фруктовый пирог", "кафетерий", "кафе-закусочная", "овсяная каша", "накрывать на стол",
            "отбивная котлета", "ростбиф", "батон", "буханка", "каравай", "молодой сыр", "яичница-глазунья",
            "ассорти", "мороженое", "крыжовник", "тефтели", "фрикадельки", "яйцо", "осетрина", "сдобное тесто",
            "овощи", "слива", "поваренная книга", "петрушка", "хлеб с отрубями", "треска", "чернослив", "угорь",
            "маргарин", "предпочитать", "кувшин", "почки", "жаренный цыпленок", "кора", "кожура", "помидор",
            "хлеб", "щипцы для орехов", "жирный", "вишня", "картофельное пюре", "лещ", "клюква", "редис",
            "печенка", "рюмка", "стакан", "стеклянная посуда", "орех", "на диете", "финик", "кофеварка",
            "шпинат", "майонез", "пирог", "пирожок", "омлет", "фаршированный", "черешня", "бифштекс",
            "второй завтрак", "ланч", "овощ", "сухарь", "лук", "миска", "глубокая тарелка", "лимоновыжималка",
            "дыня", "мясорубка", "кастрюля", "ковшик", "ложка", "унести", "пшено", "меню", "яичница-болтунья",
            "жарить", "съедобный", "ячменная лепешка", "Берите", "окорочка", "спаржа", "обрабатывать на пару",
            "скумбрия", "стакан молока", "уксус", "горький", "рыбные консервы", "ежевика", "желток", "желе",
            "добавлять", "пряность", "специя", "спелый", "нож", "бидон", "малосольный", "вкусный", "оливка",
            "пища", "питание", "корица", "блюдце", "пресный", "арахис", "соковыжималка", "груша", "горчичница",
            "масленка", "яблоко", "консервированный", "оладьи", "блины", "молочный коктейль", "приправа",
            "питьё", "напиток", "имбирный пряник", "коврижка", "соленый", "курица", "куропатка", "мясная подлива",
            "плавленый сыр", "термос", "кислая капуста", "острый сыр", "куриный бульон", "скорлупа", "кукуруза",
            "зерно", "зёрнышко", "изюм", "столовая", "официантка", "кекс", "омар", "гренки", "супница", "повар",
            "гречневая крупа", "белок", "половник", "черпак", "кукурузный початок", "горшочек",
            "насадки для мясорубки", "капуста", "терка", "сушилка для посуды", "банан", "цветная капуста",
            "чипсы", "тесто", "штопор", "рябчик", "ваниль", "горох", "карп", "гарнир", "скалка", "лапша",
            "гриб", "абрикос", "завтрак", "сэндвич с яйцом", "аппетит", "хрен", "маслина", "десерт",
            "кофейник", "баклажан", "хлеб с сыром", "конфеты", "щипцы для сахара", "заказ (в ресторане)",
            "вилка", "порция", "камбала", "ресторан", "бульон", "напиток", "консервный нож",
            "икра", "йогурт", "вареное яйцо", "молочник", "обедать", "панировочные сухари", "малина",
            "апельсин", "цыпленок", "курятина", "сковородка", "консервная банка", "персик", "гусь",
            "машина для мойки посуды", "кролик", "окорок", "ветчина", "огурец", "свинина", "рыба",
            "яичница с беконом", "рис", "белый хлеб", "бобы", "фасоль", "устрица", "гуси", "лимон",
            "утятница", "таймер", "полезно", "простокваша", "домашняя птица", "молоко", "топленое масло",
            "мед", "сладость", "легкая закуска", "сливочное масло", "ягода", "ананас", "сахарница", "варенье",
            "телятина", "шоколад", "рассол", "солонка", "повидло", "мармелад", "краб", "рак", "фазан",
            "питаться", "миндаль", "виноград", "угощать", "земляника", "клубника", "грейпфрут", "тостер",
            "соль", "поваренная соль", "сосиска", "колбаса", "картофель", "манная крупа", "горчица",
            "ватрушка", "растительное масло", "чайник", "черствый (о хлебе)", "сардина", "кружка",
            "миксер", "крошки", "яйцо всмятку", "суп", "шоколадные конфеты", "булочка", "яйцо вкрутую",
            "жаренный картофель", "мандарин", "мука", "крупчатка", "сом", "гранат", "обед", "хлеб с маслом",
            "скороварка", "смородина", "тонкий кусок", "сыр", "закуска", "дичь", "торт", "кекс",
            "пирожное", "лепёшка", "салат винегрет", "прием пищи", "мука", "индейка", "официант",
            "заварочный чайник", "тарелка", "поднос", "буфет", "пудинг", "перечница", "кухонные весы",
            "кукурузные хлопья", "карамель", "грудинка", "ребра", "сахар", "бутерброд", "парное молоко",
            "щука", "свекла", "фрукты", "креветка", "рецепт", "гамбургер", "говядина", "фисташка", "мясо",
            "арбуз", "кабачок", "диета", "блюдо", "дрожжи", "морковь", "килька", "шпрота", "укроп",
            "чайная ложка", "репа", "начинка", "фарш", "форель", "баранина", "тыква", "мясной фарш",
            "фаршировать", "консервированная фасоль", "перец", "грецкий орех", "чашка", "сельдь", "свежий",
            "творог", "галеты, печенье", "черный хлеб", "лосось", "сахарная пудра", "овес", "утка",
            "мелкая тарелка"
        ]
    }
}
